app/views/sections/_form.html.erb

    <%= form.label :course_id %>
    <%= form.collection_select  :course_id, Course.all, :id, :course_PrefixAndNum, :include_blank => true %>
---
SELECT "courses".* FROM "courses"