app/views/teachers/_form.html.erb

  <%= form.label :office_id %>
  <%= form.collection_select  :office_id, Office.all. :id, :office_BuldingAndNum, :include_blank => true %>
---
SELECT "offices".* FROM "offices"