app/views/courses/_form.html.erb

SELECT "sections"."id" FROM "sections" WHERE "sections"."course_id" = ?  [["course_id", 1]]
---
    <%= form.label :section %>
    <%= form.collection_check_boxes(:section_ids, Section.all, :id, :section_TermAndYear) %>