app/views/courses/show.html.erb

<ol>
  <% @course.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = ?  [["course_id", 1]]