app/controllers/courses_controller.rb

INSERT INTO "courses" ("Prefix", "Number", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Prefix", "gfeds"], ["Number", 234], ["Description", "gkadfngkeSDG FEN"], ["created_at", "2021-09-28 19:12:52.577783"], ["updated_at", "2021-09-28 19:12:52.577783"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save